In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [17]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[2,7,3,23],[23,23,63,12],[14,25,36,97]], columns=['A1','B1','C1','D1'])

In [18]:
df1

   A1  B1  C1  D1
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3  23  23  63  12
4  14  25  36  97

In [19]:
df1.head()

   A1  B1  C1  D1
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3  23  23  63  12
4  14  25  36  97

In [20]:
df1.tail()

   A1  B1  C1  D1
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3  23  23  63  12
4  14  25  36  97

In [21]:
df1.head(3)

   A1  B1  C1  D1
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23

In [22]:
df1.tail(2)

   A1  B1  C1  D1
3  23  23  63  12
4  14  25  36  97

In [23]:
df1.shape

(5, 4)

In [24]:
df1.iloc[0,2]

3

In [25]:
df1.iloc[0:2,1:3]

   B1  C1
0   2   3
1   6   7